{
  "airline_name": "Juneyao Airlines",
  "iata_code": "HO",
  "plating_carrier": "018",
  "official_website": "https://global.juneyaoair.com/",
  "policies": {
    "involuntary_refund": "• Eligible when flight is canceled/delayed >15 min, diverted, changed, or government restriction applies.\n• Full refund including base fare and YQ/YR.\n• If first segment qualifies, downstream segments may be included.\n• Refund request must be made within ticket validity (1 year).\n• Refunds for diverted flights granted in full if routing not completed.\n\nProcessing:\n• Refunds processed only to original payment method.\n• Credit card: original card only. Currency differences may result in variation.\n• Government taxes refundable unless nonrefundable by law.",
    "involuntary_reissue": "• Applies for: delay >15 min, cancellation, misconnection under MCT, aircraft change, emergencies.\n• One free change allowed ±3 days from original date.\n• If no Juneyao flight available: other carrier allowed with consent.\n• Rerouting valid only within terms of original contract.\n• If rebooked to another airline, passenger may return to Juneyao for free within 3 days.",
    "voluntary_refund": "Voluntary Refunds:\n• Unused tickets: full refund minus applicable refund fee.\n• Partially used: refund equals remaining refundable fare minus recalculated portion and fee.\n• Refund = base fare + YQ/YR – used value – refund fee – nonrefundable amounts.\n• YQ/YR refunds follow base fare rules.\n• Infant tickets (no seat): no fee. Children: same rules as adults.\n• Refunds allowed only if all unused segments are refunded together.",
    "medical_refund": "• Medical waivers require certified diagnosis from eligible institutions.\n• Death of passenger: full refund with certificate. Companion: refund with same-day request and documentation.\n• No refund for missed flights due to personal reasons unless illness/death applies.\n• Overbooking: free rebook, refund, or alternate transport arranged.\n• Delay >4h: financial and service compensation may apply.\n• Force majeure: refund of unused segment only. No other compensation required.\n• Downgrade compensation: refund difference + flat amount (max 800 RMB).",
    "name_change": "Free Corrections:\n• Chinese pronunciation differences, simplified/traditional character variation\n• Title corrections (MR/MS/CHD)\n• Pinyin format discrepancies, name inversion\n• Legal changes with proof\n\nCharged Corrections:\n• One Chinese character or ≤6 English letters → CNY 100 fee\n• Applies only to HO-operated and HO-issued tickets\n• Contact: +86 21 95520 for approval\n\nConditions:\n• One-time correction only; agents must not modify without approval\n• Name change ≠ passenger substitution\n• English correction applies only to foreigners/minorities",
    "group_booking": "• Group pricing offered for 10+ passengers\n• Add-on refunds (seat, baggage) calculated by cabin class (J/Y)\n• Infants charged standard fee; children same as adults\n• Free correction for minor name issues, but fee applies for significant edits\n• Agents must use official channel to secure fare quote and submit name list\n• Name changes before ticketing: free\n• After ticketing: fee applies per passenger",
    "infant_policy": "• Infants: ≥14 days and <2 years old\n• One infant per adult allowed\n• Fare: 10% of adult fare (no seat)\n• Extra infant requires child ticket with seat\n• Infant may use FAA-approved seat with extra ticket\n• No financial compensation for infant fares during delays\n• Free baggage: 10kg checked + stroller/cradle/car seat (1 item)",
    "baggage_policy": "• Carry-on: 1 piece, max 10kg, 20x40x55cm\n• Checked: max 50kg per item (domestic)\n• Infant: 10kg checked + 1 stroller/cradle free\n• No valuables (e.g. cash, jewelry, documents) in checked baggage\n• Musical instruments and service dogs: subject to preapproval\n• Seat-occupying baggage allowed with special reservation (max 75kg)\n• Declared value limit: CNY 8,000 per passenger. Surcharge: 5‰ on excess",
    "seat_request_policy": "• Seat assignments not guaranteed; subject to operational changes\n• Preferred seats can be purchased separately\n• Emergency exit seats restricted to physically fit adults\n• Infant must not occupy emergency exit seat row\n• Oversized carry-on or unpaid seat item may be denied at gate",
    "short_term_cancellation_policy": "• Free cancellation if:\n  → Ticket booked via JuneyaoAir.com or mobile app\n  → Cancellation within 24 hours of purchase\n  → Flight departs at least 7 days from time of booking (≥168 hours)\n• Refunds:\n  → Credit card: processed in 7 business days\n  → Cash/check: processed in 20 business days\n• Add-on services (baggage, seat selection) are not refundable\n• Outside this window, refunds follow voluntary policy rules"
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "customer_service_phone": "+86 21 95520",
    "customer_service_email": "customercare@juneyaoair.com"
  },
  "policy_deadlines": {
    "involuntary_refund": {
      "involuntary_refund_deadline_ticket_validity": 365
    },
    "involuntary_reissue": {
      "eligible_rebooking_range_days": {
        "before_original_departure": 3,
        "after_original_departure": 3
      }
    }
  }
}