{
  "airline_name": "Air Mauritius",
  "iata_code": "MK",
  "plating_carrier": "239",
  "official_website": "https://www.airmauritius.com/en",
  "policies": {
    "involuntary_refund": "Refunds are processed in accordance with Air Mauritius’ fare rules:\n\n• **Involuntary Refunds:** If Air Mauritius cancels a flight, fails to operate as scheduled, misses a connection, or bans carriage:\n  - If no portion is used, a full refund including taxes/fees is allowed.\n  - If partially used, the refund is the difference between paid and used fare.",
    "involuntary_reissue": "Rebooking for involuntary schedule changes, long-haul misconnects, or issued tickets includes:\n\n• Option 1: Rebook same day, same airline, same RBD or lowest available fare, same cabin.\n• Option 2: Rebook next day, same conditions.\n\n• MANDATORY: Enter both canceled and rebooked flight details in the ENDO box to avoid ADMs.\n\nFor missed flights or voluntary date changes:\n• Passenger must contact their Travel Agency (TA); MK does not handle direct passenger changes.\n• TAs must contact their respective GSA.\n• <14 days before departure: MK handles if same-day travel not possible.",
    "voluntary_refund": "- If no portion is used: Full refund minus service/cancellation fees.\n  - If partially used: Refund of unused fare portion minus service/cancellation fees.\n\n• **Other Provisions:**\n  - Refund only to person named on ticket or who paid for it.\n  - Ticket and unused flight coupons must be surrendered.\n  - Refunds after ticket expiry may be denied.\n  - Refunds may be denied if ticket was shown as proof of departure from a country unless alternate proof is provided.\n  - Refunds are made in the original form and currency of payment.\n  - All refunds must be processed via authorized agents or Air Mauritius only.\n\n• **24-Hour Cancellation:** Tickets canceled within 24 hours of booking are fully refundable.",
    "medical_refund": "Waiver handling is internal to Air Mauritius.\n\n• No general waiver codes are published.\n• All refunds or reissues due to cancellations/changes must be submitted by the Travel Agency to MK.\n• Unauthorized refunds will be auto-rejected.",
    "name_change": "Corrections allowed for:\n• Spelling/typing errors\n• Maiden vs. married name (with proof)\n• Inverted surname/first name\n\n**Procedure:**\n1. Rebook in same cabin and RBD (or lowest available).\n2. Reissue under corrected name.\n3. Collect any fare difference (ADC).\n4. Apply $25 Name Change Fee.\n\n**Restrictions:**\n• No passenger substitution.\n• EMDs not permitted for name changes.\n• Not allowed on codeshares (e.g., MK/EK, MK/AF) due to KK confirmation limits.",
    "group_booking": "• A group booking requires a minimum of 10 adults on the same flight.\n• Benefits include:\n  - Preferential group fares\n  - Dedicated sales support\n  - Name changes permitted before ticket issuance\n  - Meal requests allowed (≥48 hours prior to departure)\n• Children and infants are not counted in the group minimum.",
    "infant_policy": "• Baby cots are available on international flights for infants under 12 months, ≤11 kg, and ≤74 cm. Request at booking; confirmed at check-in.\n• Cots must be stowed during takeoff/landing or turbulence.\n• Infant seat belts are provided for lap infants.\n• In-flight leg rests/bed extensions allowed on select flights (not in exit, aisle, or middle seats).\n• Children under 2 must be secured when seatbelt sign is on.\n• Infant CRDs (car seats, torso supports) must meet international aviation standards.\n  - Not permitted on domestic/Réunion/Business class segments.\n  - CRDs must be approved and declared at booking.\n  - CRDs not meeting standards may be checked in.",
    "baggage_policy": "• Free baggage allowance is stated on ticket/itinerary and depends on fare class.\n• Excess baggage subject to acceptance and additional fees.\n\n**Prohibited in Checked Baggage:**\n- Fragile/perishable items, valuables, electronics, passports, and business docs.\n- Dangerous goods (per IATA/ICAO regs).\n- Weapons (accepted only as checked baggage with proper declaration, 48+ hrs notice).\n\n**Checked Baggage:**\n- Must be labeled with passenger name.\n- Weight limit: ≤32kg per piece.\n- If delayed or carried on another flight, MK delivers unless law requires presence.\n\n**Unchecked Baggage:**\n- Must fit under seat or overhead bin.\n- Oversized items (e.g., musical instruments) require advance approval.\n\n**Claim Timelines:**\n- Baggage damage: written claim within 7 days.\n- Legal action: within 2 years of arrival/missed arrival.\n\n**Animals:**\n- Accepted with health/vaccination papers; crate required.\n- Not part of free baggage allowance.\n- Guide dogs travel free.\n- MK not liable for illness, loss, or death unless grossly negligent.",
    "seat_request_policy": "Air Mauritius honors seat reservations where possible but may reassign for operational, medical, or safety reasons. Refunds will be given if a paid seat cannot be honored.\n\n• Special assistance seats are coordinated through reservation agents.\n• CRDs and child accessories must be used per guidelines.\n• No seat assignment in exit rows for infants or special equipment.\n• Seat changes may occur even after boarding.",
    "short_term_cancellation_policy": "Tickets canceled within 24 hours of booking are eligible for full refund without penalty.\nOther voids or cancellations must follow fare rules."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": ["INV REFUND MK flight#/date-cancel."],
    "involuntary_reissue_code": ["INV REISSUE MK # of the canceled flight + the # of the new flight.", "Cancelled + new rebooked flights must be listed in ENDO (no fixed format)"],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "sales_support_email": "gsahelpdesk@airmauritius.com",
    "internal_contact": "mkeurope@airmauritius.com",
    "arc_contact": "peter.dilemme@apg-ga.us"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "eligible_rebooking_range_deadline": {
        "before_original_departure": 1,
        "after_original_departure": 1
      }
    }
  }
}