{
  "airline_name": "APG Airlines",
  "iata_code": "GP",
  "plating_carrier": "275",
  "official_website": "https://www.apgiet.com/",
  "policies": {
    "involuntary_refund": "\n\n✅ A full refund is allowed if:\n• The flight is canceled\n• The schedule is changed by 3 or more hours.",
    "involuntary_reissue": "’ involuntary reissue policy if:\n• Same route, same RBD, same carrier, and within ±3 days.",
    "voluntary_refund": "\n• Fare rules of the operating carrier apply\n• Penalties collected via CP tax code\n• If multiple carriers involved on 275 ticket, apply the most restrictive rule",
    "medical_refund": "All waiver requests must include full PNR history, as GP does not have direct access to bookings.\n• Submit via BSPLink, ARC, or APG Connect Helpdesk.\n• Waiver required when:\n  → Rebooking involves different RBD\n  → No alternates available\n  → Flight operated by another carrier\n• Use ENDO BOX indicators:\n  → SKCHG (for involuntary reissues)\n  → ONEFREECHANGE (for voluntary 1-time penalty waiver)",
    "name_change": "Name corrections are permitted for the same passenger only (not transferable).\n\nSteps:\n1. Create a new booking with correct name (same RBD or higher)\n2. Issue a new ticket on GP-275\n3. Notify APG with the new ticket number\n4. APG will provide a waiver for refund of the original ticket\n\n• A $25 penalty applies to all name corrections.",
    "group_booking": "A group is defined as 10 or more passengers traveling together.\n• Group quote requests are processed within 48 hours.\n• APG provides group quotes only for airlines it has a direct partnership with.\n• Quotes and ticketing are subject to availability and the policies of the operating carrier.\n• For all group requests, submit through official APG Connect channels or contact the Helpdesk",
    "infant_policy": "All infant and child travel rules follow the operating carrier’s policy.\n• Ensure the proper SSR codes are included in the booking\n• If baggage allowance for infants is required, confirm directly with the operating carrier prior to departure",
    "baggage_policy": "Baggage policies, including weight limits, delayed baggage, or compensation, are dictated by the operating carrier.\n• APG does not handle baggage claims directly\n• Denied boarding and baggage delay insurance available via Blue Ribbon Bags:\n  → €125 (ticket difference)\n  → €75 (hotel)\n  → €50 (transfers)\n  → $1,000/bag after 96h delay (up to 2 bags)",
    "seat_request_policy": "Seat assignments, mobility assistance, and special meal requests are handled directly by the **operating carrier**.\n• APG does not process special service requests for interline segments.\n• All ancillary service inquiries must be directed to the airline operating the segment in question.",
    "short_term_cancellation_policy": "Voiding is allowed on the day of issuance only. After that, standard refund or reissue policies apply according to fare rules and waiver eligibility."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": ["SKCHG"],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "helpdesk_email": "helpdeskiet@apg-ga.com"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "eligible_rebooking_range_deadline": {
        "before_original_departure": 3,
        "after_original_departure": 3
    }
    }
  }
}
