{
  "airline_name": "Air Moana",
  "iata_code": "not_provided",
  "plating_carrier": "432",
  "official_website": "https://en.airmoana.com/en",
  "policies": {
    "involuntary_refund": "Force majeure clause: , a credit valid for 1 year may be issued upon proof and timely notice.",
    "involuntary_reissue": "Modifications are permitted based on fare conditions and subject to service fees. Fare difference may apply.\n\n**Flex 46K:**\n• No change fees.\n• Fare adjustment may apply.\n\n**Standard 23K:**\n• No change fees.\n• Fare adjustment may apply.\n\nIf fare conditions restrict changes, passengers should verify eligibility and request assistance from Air Moana support channels.",
    "voluntary_refund": "Refunds are permitted based on fare conditions and must be requested from the original ticket issuer. Refunds include taxes if eligible. The carrier may deny refunds if:\n• The request is made after ticket validity expires.\n• The ticket was used for visa entry and the passenger cannot prove onward travel.\n• The passenger was denied entry and returned.\n• The ticket is forged, stolen, or counterfeit.\n• The passenger was refused transport due to violation.\nRefunds are governed by local regulations. In case of",
    "medical_refund": "Escalation is recommended if fare rules are unclear. No public waiver code policy. Agents must confirm case-by-case or contact Air Moana support.",
    "name_change": "Tickets are non-transferable. If another person presents the ticket, Air Moana assumes no liability for transporting or refunding them. Identity must match the ticket, and valid ID must be presented. No explicit name correction policy provided.",
    "group_booking": "Air Moana offers group rates for 10+ adult passengers traveling on the same flight.\nRequired for a quote:\n• Contact details of group lead\n• Passenger count (adults/children/infants)\n• Destination and travel date\n• Trip purpose\nRequests must be submitted via the form on their website. Group fares are subject to review and are not guaranteed without confirmation.",
    "infant_policy": "Infants under 2 years old can travel on the lap of a parent or guardian at a 90% discount on the adult fare (plus taxes). A special life jacket and seat belt will be provided for the infant during the flight",
    "baggage_policy": "**Flex 46K:** 46 kg checked baggage\n**Standard 23K:** 23 kg checked baggage\n\nBaggage must be securely packed. Dangerous items, firearms, and certain live animals are restricted. Baggage may be searched. Delayed baggage must be reported immediately; compensation applies per liability terms. Cabin baggage must be small and light. Pets allowed with prior authorization, subject to rules and extra fees. Assistance animals travel free.",
    "seat_request_policy": "Each ticket allows limited cabin baggage. Items must fit under the seat or overhead bin. Cabin space restrictions apply. Baggage exceeding limits must be checked. Passengers are responsible for unchecked baggage. Seat assignments may be adjusted for safety or operational reasons.",
    "short_term_cancellation_policy": "No published 24-hour void or same-day cancellation policy. Refer to fare conditions or contact the issuing agent for urgent changes."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "arc_support": "arc.support@apg-ga.us",
    "general_airline_contact": "airmoana.arc@apg-ga.us",
    "travel_agent_support": "recettes.ariennes@airmoana.pf",
    "helpdesk": "helpdesk@airmoana.pf"
  },
  "policy_deadlines": {
    "involuntary_refund": {
      "involuntary_refund_from_original_departure": 365
    }
  }
}