{
  "airline_name": "Aircalin",
  "iata_code": "SB",
  "plating_carrier": "063",
  "official_website": "https://us.aircalin.com/en",
  "policies": {
    "involuntary_refund": "• Permitted when Aircalin cancels or significantly delays a flight, fails to stop at the intended destination, denies boarding due to overbooking, or causes a missed connection.\n• If no portion of the ticket is used: full refund of the fare and taxes.\n• If partially used: refund of the difference between the fare paid and the fare for used segments.",
    "involuntary_reissue": "Your request is eligible under Aircalin’s reissue policy for involuntary rerouting or schedule changes.\n\n**Eligibility:**\n• Applies to flight disruptions or planned changes.\n• Reissue must be completed within 3 days of original departure date.\n\n**GDS Handling:**\n• For published fares: use FXI or revalidate via ATC.\n• For IT/negotiated fares: use FXI only with valid interline (MITA) agreements; otherwise, revalidate on same carrier and class.\n• If no interline exists, FIM may be required.\n\n**GDS Entries (Amadeus):**\n• Add SROTHSSB and AUTH in ENDO box (e.g., AUTH 01SB000/DDMMMYY).\n\n**If rerouting is declined by passenger:**\n• Refund is allowed without penalty.\n• Ticket exchange on interline partner may require 'add collect' (fare difference).",
    "voluntary_refund": "Refunds follow Aircalin's contract terms and fare conditions.",
    "medical_refund": "Waiver codes may be required for reissue or name changes involving fare rule exceptions.\n• AUTH code must be obtained through the nearest Aircalin office.\n• AUTH must be included in the ENDO box during reissue.\n• Change fees are waived for involuntary schedule changes or interline disruptions when properly documented.",
    "name_change": "Aircalin allows name corrections subject to specific conditions:\n\n**Paid Changes (4000 XPF via EMD SERF):**\n• Inversion of first and middle names\n• Maiden/married name change\n• Adding second surname (e.g., compound names)\n• Adding infant (INF)\n\n**Free Corrections:**\n• 1–2 character corrections\n• Inversion of surname and first name\n\n**Procedure:**\n• Cancel flights (ER, RFPAX), correct name, rebook (force if needed).\n• Add RM: FB DUE NAME CHANGE.\n• Reissue ticket with AUTH in FE line (if required) and issue EMD SERF for paid cases.\n• Agencies must contact nearest Aircalin office for approval.",
    "group_booking": "Group fares are available for parties of 10 or more passengers traveling on the same dates and flights.\n• Group requests must be submitted through Aircalin’s official channels.\n• Group booking policies, including deposit and payment terms, are subject to confirmation by the airline at the time of quote.",
    "infant_policy": "Infants under 2 years of age are eligible for up to 90% discount on adult base fares (excl. taxes) across all routes.\n• Inform the airline at booking if traveling with a baby.\n\n**Cradle Service:**\n• Babies under 10kg and 70cm may request a cradle.\n• Cradles must be requested at booking or at least 24 hours before departure via Aircalin’s sales team (not online).\n\n**In-Flight Requirements:**\n• Infants over 10kg or 70cm will travel on the adult’s lap with a safety belt.\n• Each infant must be accompanied by an adult.\n• One adult may accompany only one infant; a second adult is required for a second infant.\n\n**Infant Baggage:**\n• Infants are entitled to 10kg checked baggage and one stroller, cradle, or baby seat free of charge, regardless of fare class.",
    "baggage_policy": "Aircalin's baggage policies align with international standards:\n\n**Checked Baggage:**\n• Allowance depends on fare and route, and is shown on the ticket.\n• Overweight or excess baggage is subject to surcharges.\n• Fragile, valuable, or perishable items should not be checked; carrier liability is limited.\n• Special declaration of value is available at check-in (surcharge applies).\n\n**Cabin Baggage:**\n• Must fit under the seat or in overhead lockers.\n• Oversized items may be moved to checked baggage and incur surcharges.\n\n**Claims:**\n• Loss/damage must be reported within 7 days; delay within 21 days.\n• All claims require written documentation submitted through: https://us.aircalin.com/en/contact/contact-us.\n\n**Customs (New Caledonia):**\n• Entry restrictions apply to narcotics, counterfeit goods, animal/plant products, and food.\n• Visit www.aircalin.com or local authorities for more details.",
    "seat_request_policy": "Seats may be selected online based on fare type and availability.\n• Some fare types treat seat selection as an optional paid service.\n• Seat selection is not guaranteed and may change for safety, operational, or aircraft configuration reasons.\n\n**Passengers of size:**\n• May request a second adjacent seat at reduced child fare (excluding taxes).\n• Second seat does not provide additional baggage allowance.\n• Option is only available on Aircalin-operated flights and must be requested in advance.\n• If unavailable and passenger cannot fit in one seat, boarding may be denied and rebooking offered on a later flight at no extra charge (excluding incidental costs).",
    "short_term_cancellation_policy": "Aircalin does not provide a same-day void or 24-hour cancellation policy as a standard feature. \n• Voluntary cancellations are handled per fare rules.\n• Passengers are advised to review ticket conditions before purchase and may request a refund of government taxes and unused fees for non-flown tickets."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": ["INVOL REF"],
    "involuntary_reissue_code": ["AUTH 01SB000/DDMMMYY","INVOL REIS"],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "general_contact_form": "https://us.aircalin.com/en/contact/contact-us",
    "refunds_web_ticket": "https://us.aircalin.com/en/contact/refunds"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "involuntary_reissue_deadline_after_original_departure": 3
    }
  }
}