{
  "airline_name": "Aircalin",
  "iata_code": "SB",
  "plating_carrier": "063",
  "official_website": "https://us.aircalin.com/en",
  "policies": {
    "involuntary_refund": "Permitted when Aircalin cancels or delays a flight with 3 hours or more.\n- If no portion of the ticket is used: full refund applies\n- If partially used: unused sectors can be refunded",
    "involuntary_reissue": "If a schedule change results in a fare difference due to a change in class of service, routing, or carrier, the issuing agency shall consult with our team at usa@apg-ga.us for review and approval or denial.\n\n- When the schedule change does not involve a change in routing, carrier, and/or class of service, reissue all ticket coupons using the FXI/SC entry. \n- No waiver code required. \n- When the schedule change is not accepted by the client the entire ticket’s value is replaced by a credit or refunded without charge.\n\nSB Tickets + interlines: \n- Same method, the value of the new SPA must not exceed the initial value of the total routing impacted. \n- If the client refuses the proposed options, the entire ticket’s value is replaced by a credit or refunded without charge.\n- In all cases all open coupons of the ticket or residual coupons are exchanged by the agent. \n- The authorization must be given and entered in the PNR with a: SR OTHS SB-01SB000 / DDMMMYY by a SB office. The agent must request the authorization at usa@apg-ga.us\n- Agent will reissue the ticket with an addition at the end of ENDO: AUTH 01SB000 / DDMMMYY",
    "voluntary_refund": "Proceed as per fare rules associated with the ticket if changes are allowed.",
    "medical_refund": "Proceed as per fare rules associated with the ticket.",
    "name_change": "Aircalin allows name corrections subject to specific conditions:\nPaid Changes (4000 XPF via EMD SERF):\n- Inversion of first and middle names\n- Maiden/married name change\n- Adding second surname (e.g., compound names)\n- Adding infant (INF)\nFree Corrections:\n- Inversion or correction of one to two characters\n- Reversal of surname and first name\n\nProcedure when original booking class is available:\n- Cancel flights (ER, RFPAX)\n- Name update\n- Rebook\n- Add Remark: FB DUE NAME CHANGE\n- Exchange the old ticket for the new one\n- Issue an EMD SERF if applicable\n\nProcedure when original class is not available:\n- Send request to usa@apg-ga.us with passport copy.\nDo the following actions in the same PNR:\n- Cancel flights (ER ; RFPAX)\n- Name update\n- Resale flights using Force Booking\n- Insert an RM FB DUE NAME CHANGE\n- Exchange the old ticket for the new one introducing an authorisation number in FE\n- Issuance of an EMD SERF, if applicable\n\nAircalin + Interline ticket:\n- Regarding SB flights, refer to the 2 previous points.\n- Regarding interline airline flights, rebook in existing SPA booking class.\n- Reprice the PNR and collect the fare difference applicable at rebooking time.\n- Issue an EMD SERF of the amount of the fees, if existing.\nOr, if the customer doesn’t accept, refund with applicable cancellation fee.",
    "group_booking": "Group fares are available for parties of 10 or more passengers traveling on the same dates and flights.\n- Group requests must be submitted to usa@apg-ga.us\n- Group booking policies, including deposit and payment terms, are subject to confirmation by the airline at the time of quote.",
    "infant_policy": "Infants under 2 years of age are eligible for up to 90% discount on adult base fares (excl. taxes) across all routes.\n- Inform the airline at booking if traveling with a baby by adding the SSR entry.\nCradle Service:\n- Babies under 10kg and 70cm may request a cradle\n- Cradles must be requested at booking or at least 24h before departure via Aircalin’s sales team (not online)\nIn-Flight Requirements:\n- Infants over 10kg or 70cm travel on the adult’s lap with a safety belt\n- Each infant must be accompanied by an adult\n- One adult may accompany only one infant; a second adult is required for a second infant\nInfant Baggage:\n- Infants are entitled to 10kg checked baggage and one stroller, cradle, or baby seat free of charge, regardless of fare class",
    "baggage_policy": "Refer to Aircalin website: https://us.aircalin.com/en/baggages/checked-baggages\n\nINFANT BAGGAGE ITEMS:\nOn all booking classes, infants (<2 years old) are allowed one piece of baggage weighing 10 kg + a cradle, pushchair or baby seat.\nException: Flights to Port Vila operated by Air Calédonie (SB3240 and SB3241) have an allowance of 5 kg.",
    "seat_request_policy": "Some fare types treat seat selection as an optional paid service.\n- Seat selection is not guaranteed and may change for safety, operational, or aircraft configuration reasons\nPassengers of size:\n- May request a second adjacent seat\n- Second seat does not provide additional baggage allowance\n- Option is only available on Aircalin-operated flights and must be requested in advance\n- If unavailable and passenger cannot fit in one seat, boarding may be denied and rebooking offered on a later flight",
    "short_term_cancellation_policy": "Aircalin does not provide a same-day void or 24-hour cancellation policy as a standard feature.\n- Voluntary cancellations are handled per fare rules\n- Agents are advised to review ticket conditions before purchase"
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [
      "INVOL REF"
    ],
    "involuntary_reissue_code": [
      "AUTH 01SB000/DDMMMYY",
      "INVOL REIS"
    ],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "general_contact_form": "https://us.aircalin.com/en/contact/contact-us",
    "refunds_web_ticket": "https://us.aircalin.com/en/contact/refunds"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "involuntary_reissue_deadline_after_original_departure": 3
    }
  }
}
