{
  "airline_name": "Cyprus Airways",
  "iata_code": "CY",
  "plating_carrier": "078",
  "official_website": "https://www.cyprusairways.com/en-GB",
  "policies": {
    "involuntary_refund": "- Refunds cannot be processed through GDS; only via IAR with prior authorization from carrier staff.\n- Email request to Elena Shreyder <elena.shreyder@cyprusairways.com>.\n- Involuntary refunds allowed in cases of cancellation or changes to Terms of Carriage.\n- Refunds processed to original form of payment.\n- No refund for schedule changes under 1 hour.\n- Refund for no-show: only airport taxes refundable.\n- Refund for duplicate bookings must be requested within 24h with proof of full payment.\n- Group cancellations under time limits: only airport taxes refundable.\n- Group cancellations beyond 30–45 days from departure: fare and airport taxes refundable; YR, ancillaries, and fees non-refundable.",
    "involuntary_reissue": "- All exchanges and adjustments must be handled manually.\n- GDS-based exchanges not permitted.\n- Minor schedule changes (<1h) do not entitle passenger to free rebooking.\n- Rebooking due to major changes/cancellations is allowed per Carrier Regulations.\n- Group bookings: Date change before ticketing is free; after ticketing EUR 50 fee + fare difference.\n- Group name changes after ticketing permitted at EUR 50 per passenger.\n- Requests via email to elena.shreyder@cyprusairways.com.",
    "voluntary_refund": "- Refunds are not processed through GDS; only via IAR with prior authorization.\n- Request must be submitted via email to Elena Shreyder <elena.shreyder@cyprusairways.com>.\n- Refunds due to carrier fault or flight cancellation are permitted with carrier approval only.\n- Taxes may be refundable if not remitted to authorities; reasonable service charge may apply.\n- Refund only made to original payer; proof of payment required.\n- Ticket surrender may be required.\n- Refunds are made in original currency unless Carrier Regulations specify otherwise.\n- Credit card fees are non-refundable.\n- Voluntary refunds for ancillary services (baggage, seats, pets) are not permitted.",
    "medical_refund": "- No publicly available waiver code system.\n- Prepaid ancillary services (AVIH/PETC) refundable only for involuntary changes.\n- Contact escalation support for special handling to Elena Shreyder <elena.shreyder@cyprusairways.com>.\n- Carrier discretion applies to all manual processing of refunds or schedule disruption compensation.",
    "name_change": "Name Correction:\n- EUR 50 per ticket. Ticket reissue is provided by Cyprus Airways office upon agent’s request and airline authorization.\n- Email request to Elena Shreyder <elena.shreyder@cyprusairways.com> and RI@cyprusairways.com.\nSteps:\n1. SSR Name Change must be created by the agent (e.g., SR CHNT CY NN1-TAMIR/MATY MRS/P2).\n2. Remove Ticket Arrangement element (FA) for the affected passenger.\n3. Once CY staff updates PNR, agent must reissue ticket & issue an EMD-S RFISC D/993 with comment “NAME CHANGE FEE”.\n4. YQ tax is non-transferable and must be recollected.\n5. EUR 50 fee is collected via EMD-S RFISC D/993.",
    "group_booking": "- Minimum group size: 10 adult passengers.\n- Infant fares apply; no child discount.\n- Group may be one-way or round-trip.\n- Fare must be quoted and approved by Sales Department; group rules differ from public fares.\n- Contact: groups@cyprusairways.com.\n- Date change:\n  → Before ticketing: Free (subject to availability)\n  → After ticketing: EUR 50 fee + fare difference\n- Name changes:\n  → Before ticketing: Free\n  → After ticketing: EUR 50 fee per name\n- Deposit: Not required.\n- Payment deadlines:\n  → High season: 30 days before departure\n  → Low season: 21 days before departure\n- Release periods:\n  → High season: 1st release 45 days, 2nd release +10% up to 30 days\n  → Low season: 1st release 30 days, 2nd release +10% up to 21 days\n- Cancellation:\n  → Under time limit: only airport taxes refundable\n  → Over 30/45 days: fare + taxes refundable (YR excluded)\n- No-show: only airport taxes refundable.\n- Ticketing deadline: 5 working days before departure.\n- Baggage included:\n  → Cabin: 1x10kg (55x40x20 cm) + 1 personal item (35x20x20 cm)\n  → Checked: 1x23kg (max 203 cm)\n- Sports equipment: EUR 50 per sector.",
    "infant_policy": "- Infants not accepted for travel within first 7 days of birth.\n- Mothers not expected to travel within 7 days postpartum unless accompanied by a medically qualified person.\n- Tel Aviv: EUR 24 per sector; other destinations: EUR 20 per sector.\n- One infant per adult.\n- Infants not allowed in emergency exit rows.\n- Infant fare applies in group bookings.\n- Passengers with disabilities or limited mobility receive adapted services upon notification.",
    "baggage_policy": "- Cabin: 1x10kg (55x40x20 cm) + 1 personal item (35x20x20 cm).\n- Checked baggage: 1x23kg (max 203 cm) included in group fares.\n- Sports equipment: EUR 50 per sector.\n- Dangerous items (weapons, lithium batteries, ammunition, etc.) prohibited under ICAO/IATA rules.\n- Valuable items (electronics, documents, jewelry, medicine) should not be checked.\n- Firearms only as checked baggage, unloaded, with advance approval.\n- Guide dogs allowed free in cabin with documentation; emotional support animals not permitted.\n- Max 3 in-cabin pets per flight; must be in locked crate under 10kg including container.\n- AVIH: container must meet IATA standards. Up to 2 animals (<14kg each) or 3 young animals (<6mo) allowed per crate.",
    "seat_request_policy": "- Prepaid seat selection (EMD) is non-refundable voluntarily.\n- Involuntary refunds allowed if flight cancelled or seat not provided.\n- Seats must comply with aircraft restrictions.\n- Oversized carry-ons at gate must be paid and checked.\n- Seat disputes/reassignments not eligible for compensation unless in breach of contract.",
    "short_term_cancellation_policy": "- Duplicate bookings refundable with proof of full payment within 24h.\n- All voids handled manually via escalation contact.\n- No automatic same-day voids in GDS.\n- Voluntary cancellations subject to manual refund policy and fare conditions."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "arc_support_email": "arc.support@apg-ga.us",
    "arc_agency_email": "cyprusair.arc@apg-ga.us",
    "group_support_email": "groups@cyprusairways.com"
  },
  "policy_deadlines": {
    "group_booking": {
      "group_cancellation_before_departure_days": 30
    }
  }
}
