{
  "airline_name": "Cyprus Airways",
  "iata_code": "CY",
  "plating_carrier": "078",
  "official_website": "https://www.cyprusairways.com/en-GB",
  "policies": {
    "involuntary_refund": "Involuntaryrefunds allowed in cases of cancellation or changes to Terms of Carriage.\n• Refunds processed to original form of payment.\n• No refund for schedule changes under 1 hour.\n• Refund for no-show: only airport taxes refundable.\n• Refund for duplicate bookings must be requested within 24h with proof of full payment.\n• Group cancellations under time limits: only airport taxes refundable.\n• Group cancellations beyond 30–45 days from departure: fare and airport taxes refundable; YR, ancillaries, and fees non-refundable.",
    "involuntary_reissue": "• All exchanges and adjustments must be handled manually.\n• GDS-based exchanges not permitted.\n• Minor schedule changes (<1h) do not entitle passenger to free rebooking.\n• Rebooking due to major changes/cancellations is allowed per Carrier Regulations.\n• Group bookings: Date change before ticketing is free; after ticketing allowed with EUR 50 fee + fare difference.\n• Name changes after ticketing for groups permitted at EUR 50 per passenger.",
    "voluntary_refund": "Refunds are not processed through GDS.\n• All refund requests must be handled manually by Cyprus Airways.\n• Refunds due to carrier fault or flight cancellation are permitted.\n• Taxes may be refundable if not remitted to authorities; reasonable service charge may apply.\n• Refund only made to original payer; proof of payment required.\n• Ticket surrender may be required.\n• Refunds are made in original currency unless Carrier Regulations specify otherwise.\n• Credit card fees are non-refundable.\n• Voluntary refunds for ancillary services (baggage, seats, pets) are not permitted.",
    "medical_refund": "• No publicly available waiver code system.\n• Involuntary changes may qualify for waiver of refund or reissue fees.\n• Prepaid ancillary services (AVIH/PETC) may be refunded only for involuntary changes.\n• Contact escalation support for special handling.\n• Carrier discretion applies to all manual processing of refunds or schedule disruption compensation.",
    "name_change": "• Name changes are not allowed on individual tickets.\n• Once issued, a ticket cannot be transferred to another person.\n• Manual support required for error resolution via arc.support@apg-ga.us.\n• Group bookings: Name changes before ticketing are allowed; after ticketing allowed with EUR 50 fee per name.",
    "group_booking": "• Minimum group size: 10 adult passengers.\n• Child fare: Not applicable. Infant fares apply.\n• Group can be one-way or round-trip.\n• Fare must be quoted and approved by Sales Department.\n• Fare rules differ from public fare rules.\n• Contact: groups@cyprusairways.com\n• Flight date change:\n  → Before ticketing: Free, subject to availability\n  → After ticketing: EUR 50 fee + fare difference\n• Name changes:\n  → Before ticketing: Free\n  → After ticketing: EUR 50 fee per name\n• Deposit: Not required\n• Full payment deadlines:\n  → High season: 30 days before departure\n  → Low season: 21 days before departure\n• Release periods:\n  → High season: 1st release 45 days, 2nd release +10% up to 30 days\n  → Low season: 1st release 30 days, 2nd release +10% up to 21 days\n• Cancellation:\n  → Under time limit: only airport taxes refundable\n  → Over 30/45 days before departure: fare and taxes refundable (YR excluded)\n• No-show: only airport taxes refundable\n• Ticketing deadline: 5 working days before departure\n• Included baggage:\n  → Cabin: 1x10kg (55x40x20 cm) + personal item (35x20x20 cm)\n  → Checked: 1x23kg (max 203 cm)\n• Sports equipment: EUR 50 per sector",
    "infant_policy": "• Infants not accepted for travel within first 7 days of birth.\n• New mothers not expected to travel within 7 days postpartum unless accompanied by a medically qualified person.\n• Tel Aviv: EUR 24 per sector; Other destinations: EUR 20 per sector.\n• One infant per adult.\n• Infants not allowed in emergency exit rows.\n• Infant fare applies in group bookings.\n• Passengers with disabilities or limited mobility will receive adapted services upon notification.",
    "baggage_policy": "• One standard hand baggage item permitted per passenger (10kg; 55x40x20cm) plus 1 personal item (35x20x20cm).\n• Checked baggage: 1x23kg (max 203cm) included in group fares.\n• Sports equipment: EUR 50 per sector.\n• Dangerous items (weapons, lithium batteries, ammunition, etc.) prohibited under ICAO/IATA rules.\n• Valuable items (electronics, documents, jewelry, medicine) should not be checked.\n• Checked baggage must be tagged and securely packed.\n• Firearms allowed as checked baggage only if unloaded and approved in advance.\n• Guide dogs allowed free in cabin with proper documentation; emotional support animals not permitted.\n• Max 3 in-cabin pets per flight; must be in a locked crate under 10kg including container, stored under seat.\n• AVIH (animals in hold): container must meet IATA standards. Up to 2 animals (each <14kg) or 3 young animals (<6mo) allowed per crate.",
    "seat_request_policy": "• Prepaid seat selection processed via EMD is non-refundable on a voluntary basis.\n• Involuntary refunds allowed if flight is cancelled or seat not provided.\n• Seats must comply with aircraft storage restrictions.\n• Oversized carry-ons detected at gate must be paid for and checked.\n• Seat disputes or reassignments are not eligible for compensation unless in breach of contract of carriage.",
    "short_term_cancellation_policy": "• Refund requests for duplicate bookings must be submitted with proof of full payment within 24h.\n• All void requests processed manually via internal escalation contact.\n• No automatic void or same-day cancellation system offered through GDS.\n• Voluntary cancellations are subject to manual refund policy and fare conditions."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "arc_support_email": "arc.support@apg-ga.us",
    "arc_agency_email": "cyprusair.arc@apg-ga.us",
    "group_support_email": "groups@cyprusairways.com"
  },
  "policy_deadlines": {
    "group_booking": {
      "group_cancellation_before_departure_date_days": 30
    }
  }
}
  