{
  "airline_name": "Luxair",
  "iata_code": "LG",
  "plating_carrier": "149",
  "official_website": "https://www.luxair.lu/en/",
  "policies": {
    "involuntary_refund": "Involuntary Refund:\n- If the originally booked flight was cancelled (UN in PNR), agent may proceed with full refund.\n- If alternate flight was cancelled prior to departure, full refund is allowed without waiver.\n- Agent must provide PNR history showing cancellation (XS segment).\n\n24-Hour Risk-Free:\n- Luxair offers a 24-hour risk-free refund for tickets purchased at least one week before departure through official channels (website or app).",
    "involuntary_reissue": "Involuntary Exchange:\n- Free exchange allowed within 3 days of original flight.\n- If rebooking outside that window or same class unavailable → fare difference applies.\n- No waiver code required.\n\nVoluntary Changes:\n- Must follow fare rules displayed in GDS.\n- Change fees and fare differences may apply depending on fare category.\n- If change results in lower fare, no residual refund unless permitted by fare rules.",
    "voluntary_refund": "Voluntary Refunds:\n- Agents must check fare conditions via FQN in GDS.",
    "medical_refund": "- No formal waiver code system is published.\n- Involuntary cases do not require waiver for refund or exchange (e.g., UN segment).\n- Escalation for exceptional refund or tax correction must be sent to Claude at Luxair HQ.",
    "name_change": "- One-letter correction allowed in first or last name.\n- No reissue required.\n- OSI must be added to the PNR for audit trail.\n- Complete name changes or corrections beyond one letter are not permitted; reissue may be required as per fare rules.",
    "group_booking": "- Groups of 10 or more must be requested via Luxair Groups team.\n- Deposit and payment timelines apply based on departure date.\n- Group fare includes checked baggage; seat selection and other ancillaries must be confirmed separately.\n- Group contract may allow limited free name changes prior to ticketing.\n- Infants within group: 90% discount when traveling on lap.",
    "infant_policy": "- Infants (under 2 years old) may travel on adult's lap with 90% fare discount.\n- For additional comfort, adult may purchase an extra seat at child fare and use an approved car seat.\n- Infant must be at least 7 days old to travel.\n- Child fare (25% discount) applies to passengers age 2 to under 12.\n- If child turns 2 during the trip, full child fare applies throughout; contact Luxair to book appropriately.",
    "baggage_policy": "- Carry-on: 1 cabin bag (max 8kg) + 1 personal item allowed.\n- Checked baggage: Allowance depends on fare type and route (reflected on ticket).\n- Excess baggage fees apply; over 32kg not accepted.\n- Musical instruments and sports equipment accepted per size and liability waiver.\n- Pets must be in approved carriers; total weight limit applies.\n- Compensation capped at 1,519 SDR for lost or damaged baggage.\n- Passengers advised not to place valuables in checked luggage.",
    "seat_request_policy": "- Advance seat selection available for a fee or included depending on fare/flex bundle.\n- Emergency exit row seats restricted to passengers 16+, non-disabled, not pregnant, and not traveling with pets or infants.\n- If Luxair must move a passenger for safety or operational reasons, seat fee may be refunded.",
    "short_term_cancellation_policy": "- Tickets may be voided same-day within BSPLink standard window.\n- After that window, refund rules apply per fare category.\n- No post-midnight voiding unless authorized by Luxair ARC contact.\n- No penalty-free void outside same-day issuance window."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "sales_support_email": "luxair.arc@apg-ga.us",
    "refund_escalation_email": "claude.scherer@luxairgroup.lu",
    "internal_admin_email": "Ilisa.vazalves@luxairgroup.lu"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "eligible_rebooking_range_deadline": {
        "before_original_departure": 3,
        "after_original_departure": 3
      }
    }
  }
}
