{
  "airline_name": "Air Moana",
  "iata_code": "NM",
  "plating_carrier": "432",
  "official_website": "https://en.airmoana.com/en",
  "policies": {
    "involuntary_refund": "Force majeure clause: a credit valid for 1 year may be issued upon proof and timely notice.",
    "involuntary_reissue": "In case of schedule change decided by the company:\n- Modification without fee\n- Cancellation without fee\n- Refund upon request\n- Free transfer to another flight if more adapted and suitable for the guest\n- No waiver code required.",
    "voluntary_refund": "Refunds are permitted based on fare conditions and must be requested from the original ticket issuer. Refunds include taxes if eligible. The carrier may deny refunds if:\n- The request is made after ticket validity expires.\n- The ticket was used for visa entry and the passenger cannot prove onward travel.\n- The passenger was denied entry and returned.\n- The ticket is forged, stolen, or counterfeit.\n- The passenger was refused transport due to violation.\nRefunds are governed by local regulations.",
    "medical_refund": "Escalation is recommended if fare rules are unclear. No public waiver code policy. Agents must confirm case-by-case or contact Air Moana support.",
    "name_change": "- Name correction allowed.\n- Up to 3 characters in the first name and 3 characters in the last name can be modified before ticketing.\n- No name change (passenger substitution) is allowed.",
    "group_booking": "Contact our group department (groupe@airmoana.pf).\nAir Moana offers group rates for 10+ adult passengers traveling on the same flight.\nRequired for a quote:\n- Contact details of group lead\n- Passenger count (adults/children/infants)\n- Destination and travel date\n- Trip purpose\n- Group fares are subject to review and are not guaranteed without confirmation.",
    "infant_policy": "- Infants under 2 years old can travel on the lap of a parent or guardian at a 90% discount on the adult fare (plus taxes).\n- A special life jacket and seat belt will be provided for the infant during the flight.\n- No UMNR accepted.\n- It is possible to associate an infant with a ticketed adult.",
    "baggage_policy": "The allowed checked baggage allowance varies from 15 kg to 46 kg per passenger depending on fare conditions:\n- 46 kg for tickets: Flex 46K\n- 23 kg for tickets: Flex 23K, Standard 23K, Special Offer 23K\n- 15 kg for tickets: Flex 15K, Special Offer 15K, Blue Fare\nPlease note, the maximum weight per piece is 32 kg.",
    "seat_request_policy": "Seats to be assigned in the GDS.",
    "short_term_cancellation_policy": "No published 24-hour void or same-day cancellation policy. Refer to fare conditions or contact the issuing agent for urgent changes."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "arc_support": "arc.support@apg-ga.us",
    "general_airline_contact": "airmoana.arc@apg-ga.us",
    "travel_agent_support": "recettes.ariennes@airmoana.pf",
    "helpdesk": "helpdesk@airmoana.pf"
  },
  "policy_deadlines": {
    "involuntary_refund": {
      "involuntary_refund_from_original_departure": 365
    }
  }
}
