{
  "airline_name": "Arajet",
  "iata_code": "DM",
  "plating_carrier": "653",
  "official_website": "https://www.arajet.com/",
  "policies": {
    "involuntary_refund": ", delays >2 hours, or denied boarding: Full refund, voucher, or rebooking offered.\n• If taxes were not paid to authorities, they may be refunded; otherwise, the customer must claim them directly.\n• All refunds are processed to original form of payment, except cash which may be refunded as an Arajet voucher.\n• Fare is non-refundable outside the above exceptions.\n• Refunds processed within 30 days of request.",
    "involuntary_reissue": "Flight date/time changes are allowed:\n• Must be made at least 24 hours prior to departure.\n• Subject to applicable service fee and fare difference.\n• Route changes are not permitted.\n• Existing services (like seats) will transfer when possible.\n• If not available, an alternative or refund of that service may be offered.",
    "voluntary_refund": "Refunds are only permitted under specific conditions:\n• Within 24 hours of booking and at least 7 days prior to departure: Full refund of the fare (excluding service fees already rendered).",
    "medical_refund": "No formal waiver code system. Changes outside published conditions require manual review.\n• Involuntary changes (cancellation, delay, etc.): Waiver not required—eligible for refund or rebooking.\n• Voluntary changes follow bundle fare rules with applicable fees and fare difference.",
    "name_change": "Name changes allowed under these rules:\n• One free name change per 20 pax in group bookings.\n• Must be requested at least 24 hours before departure.\n• If the correction is 3 characters or less and requested before check-in, no fee applies.\n• Changes of 4+ characters or complete name changes incur a fee and fare difference.",
    "group_booking": "• Group bookings: Minimum 21 pax.\n• Series: 4 groups minimum of 16 pax each (12 pax minimum to maintain group status).\n• Passenger names due 10 days before departure (20 days for Canada/Saint Martin).\n• Not bookable within 7 days of departure.\n• One free name change per 20 pax.\n• Infants: 5% of adult fare plus tax.\n• Full payment schedule applies.\n• Additional services/baggage not included unless confirmed.",
    "infant_policy": "• Infants: 8 days to under 2 years old.\n• May travel on adult's lap for 5% of fare + tax.\n• Infants are not eligible for baggage or additional services.\n• Adults traveling with an infant receive one extra personal item and may check one stroller or car seat free of charge.\n• Infants must be booked; documentation required to confirm age.",
    "baggage_policy": "• One personal item included: max 6kg, 40x25x20cm.\n• Carry-on baggage: one piece up to 12kg, 56x46x25cm (must be pre-purchased or included in bundle).\n• Checked baggage: up to 3 pieces, max 32kg and 366cm linear each. Fees apply unless included in bundle.\n• Fragile or valuable items (electronics, musical instruments) should not be checked; limited liability applies.\n• Musical instruments and sports equipment accepted with fees, size/weight restrictions, and release of liability.\n• Compensation for lost/damaged baggage: up to 1131 SDRs (Montreal Convention).",
    "seat_request_policy": "• Advanced seat selection available for a fee depending on bundle or service.\n• Some seats (exit rows, bulkhead) have eligibility restrictions (age, ability to assist in evacuation, etc.).\n• Customers with medical or special needs may receive designated seats without additional cost.\n• If moved for operational/safety reasons, seat fees may be refunded as a voucher.\n• Emergency exit seats cannot be assigned to passengers under 16, pregnant women, or those traveling with infants or pets.",
    "short_term_cancellation_policy": "Arajet offers a 24-hour risk-free cancellation policy:\n• Must be requested within 24 hours of booking AND at least 7 days prior to departure.\n• After this window, bookings are subject to the standard refund and change policies outlined in the bundle fare conditions.\n• No same-day void beyond that window."
  },
  "agency_exclusion_list": {
    "excluded_agencies": ["Expedia", "Priceline", "Hopper", "Fareportal", "Travix", "Atlas Travel", "Consolid Global (Volans)", "Despegar"]
  },
  "endorsement_codes": {
    "involuntary_refund_code": [],
    "involuntary_reissue_code": [],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "sales_support_phone": "1-305-404-9382",
    "sales_support_email": "sales@arajet.com",
    "spanish_sales_email": "ventas@arajet.com",
    "whatsapp_checkin": "+1-809-282-7000",
    "gds_support_email": "gds.support@arajet.com",
    "groups_support_email": "groups@arajet.com"
  },
  "policy_deadlines": {
    "involuntary_reissue": {
      "involuntary_reissue_deadline_before_departure": 24
    },
    "group_booking": {
      "group_names_deadline_before_departure": 10,
      "group_names_deadline_before_departure_canada_saint_martin": 20,
      "group_booking_cutoff_before_departure_days": 7
    }
  }
}