{
  "airline_name": "Hong Kong Airlines",
  "iata_code": "HX",
  "plating_carrier": "851",
  "official_website": "https://www.hongkongairlines.com/en_HK/hx/homepage",
  "policies": {
    "involuntary_refund": "• Eligible if HX cancels flight, causes missed connection, or fails to stop at destination.\n• 100% refund if unused; otherwise, refund based on unused portion.\n• Must be requested within 60 days of disrupted flight.\n• Refund not applicable if processed at airport.\n\nRefund on Lost Tickets:\n• Available 3 months after expiry with proof of loss, indemnity form, and admin fee.",
    "involuntary_reissue": "• Rebooking due to flight irregularities must be processed within 10 days of the affected flight.\n• New flight must depart within 2 days before or 7 days after original date.\n• Change must be to first available HX-operated flight.\n• One-time waiver applies only; further changes subject to fare rules.\n• Fare/tax difference collected if new routing is more expensive.\n• Group tickets must be handled via local support; not eligible for FIT waivers.",
    "voluntary_refund": "Voluntary Refunds:\n• Must follow fare rules; refund amount may be reduced by cancellation or service fees.\n• Unused portion: refunded as difference between fare paid and used portion.\n• Request must be made through original issuing office.\n• Refunds only issued to original payer upon proof of purchase.\n• No refund for expired tickets unless required by law.\n• Fare rules vary by region and are strictly enforced.",
    "medical_refund": "• Applies to FIT (individual) tickets only.\n• Delay >3 hours, flight cancellation, interline misconnection, or HX minimum connection time updates qualify.\n• One-time reissue or reroute permitted per policy window.\n• Refund waiver applies even on non-refundable tickets if submitted within 60 days of the affected flight.\n• No waiver if passenger is a no-show.\n• Rerouting limited to same regional zone (China/Japan).",
    "name_change": "Individual Bookings (FIT):\n• One-time free change allowed for:\n  → Title/gender correction\n  → Middle name correction\n  → Inverted name order\n  → ≤3-character spelling fix\n  → Legal changes (marriage, divorce, etc.) with documentation\n• All other changes: HKD 400 or equivalent applies\n\nGroup Bookings:\n• Same free-change rules apply\n• Additional changes:\n  → HKD 500 (normal season)\n  → HKD 800 (peak season)\n\nTour Leader:\n• Fee waived with medical certificate and staff ID\n• Otherwise subject to same HKD 500–800 fee\n\nOSI Required Post-Change:\n• Add OSI: 'OSI HX NAME CHANGE FM [OLD] TO [NEW] X NAME CHANGE FEE [WAIVED OR COLLECTED]'\n• If change done at airport: annotate PNR and notify CSC.",
    "group_booking": "• Group tickets must be handled via local support channels.\n• Name changes and reissues follow group fee matrix:\n  → HKD 500 (standard)\n  → HKD 800 (peak season)\n• Tour leader name changes waived for medical emergencies (proof required)\n• Group rebooking support handled offline\n• No B2C support offered by APG USA—must contact local station",
    "infant_policy": "• Infants under 7 days old are not permitted.\n• One infant per adult allowed.\n• Infant ticket fare and baggage allowance vary by region.\n• Service animals permitted per disability rules.\n• Cradles, child seats, or bassinets available on request based on aircraft and seat availability.",
    "baggage_policy": "• Carry-on: must fit under seat or in overhead bin; size and weight limits apply.\n• Checked: 32kg max per piece; fees apply for excess or overweight baggage.\n• Fare families determine free checked bag allowance.\n• No valuables or fragile items in checked baggage.\n• Firearms, weapons, and hazardous materials not allowed unless approved in advance.\n• Service animals allowed in cabin free of charge under conditions.\n• Lost baggage must be reported within 21 days; damaged baggage within 7 days.\n• Musical instruments or oversized items must be approved in advance.",
    "seat_request_policy": "• Seat assignment is not guaranteed even if preselected.\n• Carrier may reassign for operational, safety, or legal reasons.\n• Special meals, Wi-Fi, and inflight services not guaranteed and may vary by fare family.\n• Refund for seat fees available only if involuntarily changed.\n• Advance seat selection restricted by fare tier and availability.",
    "short_term_cancellation_policy": "• Voluntary cancellations are subject to fare rules.\n• Refunds permitted only to original form of payment.\n• No refund if travel documents are missing or visa denied.\n• No refund if used as proof of outbound travel without departure\n• Airport refunds are not allowed.\n• Refund of airport taxes only if cancellation is beyond validity or required by law."
  },
  "agency_exclusion_list": {
    "excluded_agencies": []
  },
  "endorsement_codes": {
    "involuntary_refund_code": ["RM-170604-PT"],
    "involuntary_reissue_code": ["RM-170604-PT"],
    "medical_refund_code": []
  },
  "support_contacts": {
    "_note": "For internal use only. Do not include in autoresponse emails.",
    "b2c_support_email": "call.center@hkairlines.com",
    "b2c_support_phone_hk": "+852 3916 3666",
    "b2c_support_phone_cn": "95071500"
  },
  "policy_deadlines": {
    "involuntary_refund": {
      "involuntary_refund_days_after_flight": 60
    },
    "involuntary_reissue": {
      "involuntary_reissue_days_after_disruption": 10,
      "eligible_rebooking_range_days": {
        "before_original_departure": 2,
        "after_original_departure": 7
      }
    },
    "medical_refund": {
      "medical_refund_days_after_disruption": 60
    }
  }
}